[
    {
        "createdAt": "Mon, 17 Feb 2014", 
        "indent": 0, 
        "message": "<p>I'm interested in how this might be used when most of the participants are in the same physical room.</p><p>I'm imagining a scenario where each person has their own dedicated tab within my browser. If they want to capture the attention of the group, they can do a thing that makes their tab start blinking.. or captures attention after a warning.</p><p>It would also be interesting to delegate presenting ability to a third party. So, I can mind my own business, someone else can pop in to see what I'm up to, and then they can push my activity to the larger group for whatever reason.</p><p>I'd also like to see view-casting of some kind. So a computer can be hooked up to the big presentation screen in the room and stay unattended while everyone else uses their own computers to push to the main screen.</p><p>Which actually leads to multi-screen applications. If I have my laptop and mobile devices connected to Hotdish, one or the other could show a social discovery/control interface of some kind.</p><p>This is starting to sound a bit like <a href=\"http://www.oblong.com/mezzanine/\" rel=\"nofollow noopener\" title=\"http://www.oblong.com/mezzanine/\">http://www.oblong.com/mezza...</a> actually..</p><p>The thought of messing with history makes me wonder if there might be some useful collaborative bookmarking action that could happen here. If I'm presenting, and viewers bookmark the page I'm currently on, I'd love to see some kind of notification.. perhaps a blinky bookmark star. Beyond this, shared bookmarking and annotation space tied to a session. The activity log is one potential output for this, but it strikes me that a collaborative editor that lets you play with bookmark-based data structures would be a great way to move research beyond Hotdish.</p><p>I wonder how downloads would be treated. There may be some interesting file sharing applications here. Shoot, how might Hotdish treat bittorrent magnet links?</p>", 
        "order": "001248718888", 
        "who": "Captain Lyre Calliope"
    }, 
    {
        "createdAt": "Tue, 18 Feb 2014", 
        "indent": 1, 
        "message": "<p>I think the approach we're taking makes as much sense when you are co-located as not.  This is one of the reasons for being permissive and expecting people to come to their own understanding about how to interact.  If we're in the same room, for instance, we will have our own conversation about what we're doing, and the actions in the browser will flow from that.  If you have workflows and permissions and stuff going on then the tool draws you in and force you to interact via the tool.</p><p>Group-based bookmarking is something I've felt a desire for myself as I use the tool.  Adding notification as you suggest would also be good.  One could go even further and imagine a thumbs-up, but then I worry that would be too cloying.  But there is a subtle social interaction in the Like that appeals to me, and I sometimes want in other contexts.  I suppose more often when the group is large, and I want to signify approval without interrupting.</p><p>Thanks for the link to Mezzanine, I hadn't seen that and it's quite interesting.</p>", 
        "order": "001248718888,001249223392", 
        "who": "Ian Bicking"
    }
]