[
    {
        "createdAt": "Tue, 05 Mar 2019", 
        "indent": 1, 
        "message": "<p>Also, websites/webapps in the browser, are transient. As in, I only sometimes want to go to them. Even pinned tabs eventually get closed. An app, like Slack, is something that I want to keep open and not connected to my browser.</p><p>There's also a local vs. remote aspect. I expect an app to store things on my device and not to upload things to the web. If I open a webapp in a browser, then I expect it to upload my data to the web. Even if the app supposedly only uses local storage.</p><p>Electron also adds in the ability to code parts of an app in C/C++/etc when Javascript just can't give the performance that is needed.</p><p>I haven't gotten very far learning Electron yet, but one interesting thing is that you can disable remote scripts entirely in an Electron app. You can't do that in a webapp.</p><p>All that said, I do wish Mozilla would release a competitor to Electron. The web is way to dependent on libchromium for comfort right now.</p>", 
        "order": "004364106135,004364301674", 
        "who": "jerrac"
    }, 
    {
        "createdAt": "Mon, 04 Mar 2019", 
        "indent": 0, 
        "message": "<p>With regards to \"whatever people get from Electron\", it's app-like behavior. It's in my app launcher / start menu / desktop. It has its own window, and isn't shared with other browser tabs. I can use OS-specific shortcuts to launch, switch to, and close it.</p><p>And, secondarily, native integration into the OS is nice, too. (Example: An HTML5 audio app displays audio controls on the phone's lockscreen.)</p><p>I believe progressive web apps (PWAs) are the way forward for app-like behavior.</p>", 
        "order": "004364106135", 
        "who": "Judah Gabriel Himango"
    }, 
    {
        "createdAt": "Tue, 05 Mar 2019", 
        "indent": 2, 
        "message": "<p>+1 for the Gecko based Electron competitor, maybe Positron will come back some day!? <a href=\"https://github.com/mozilla/positron\" rel=\"nofollow noopener\" title=\"https://github.com/mozilla/positron\">https://github.com/mozilla/...</a></p>", 
        "order": "004364106135,004364301674,004364307001", 
        "who": "Al"
    }, 
    {
        "createdAt": "Tue, 05 Mar 2019", 
        "indent": 0, 
        "message": "<p>I have been working on the timed repetition one for the past couple of years.</p><p><a href=\"https://vocabifyapp.com\" rel=\"nofollow noopener\" title=\"https://vocabifyapp.com\">https://vocabifyapp.com</a></p><p>It's a Chrome extension &amp; web app for highlighting bits you read online. Then it generates flashcards for you to review on a spaced repetition-type schedule. No Firefox extension yet, but shouldn't be hard to port over.</p><p>Really impressed with the other experiment proposals! Some really cool ideas.</p>", 
        "order": "004364992356", 
        "who": "Paul Breslin"
    }, 
    {
        "createdAt": "Mon, 04 Mar 2019", 
        "indent": 0, 
        "message": "<p>Hey.  Read your comment about spaced repetition and incremental reading.</p><p>You should try Polar... it's RIGHT up your alley. Implements both and has Anki sync for your flashcards.</p><p>It's a long term personal knowledge repository for your documents.  It's based on Electron and super hackable if you're interested.</p><p><a href=\"https://getpolarized.io/\" rel=\"nofollow noopener\" title=\"https://getpolarized.io/\">https://getpolarized.io/</a></p><p>I'll also hook you up with a premium account if you email me so you can get more cloud storage.</p>", 
        "order": "004364037299", 
        "who": "burtonator"
    }, 
    {
        "createdAt": "Tue, 05 Mar 2019", 
        "indent": 0, 
        "message": "<p>\"Just Save\" looks like something I've been interested in for some time.  I do a lot of stashing of copies of things on disk, but the \"File-Save As\" dialog is really clunky (and recently has gotten worse on linux-- thanks libgtk) and just using the &lt;title&gt; to get a default file name is pretty weak.</p>", 
        "order": "004365186843", 
        "who": "doomvox"
    }, 
    {
        "createdAt": "Mon, 04 Mar 2019", 
        "indent": 1, 
        "message": "<p>This this this. I don't want to use cmd-1, cmd-2, etc or ctrl-tab to switch to an app in a browser tab. I want to use cmd-tab to switch to an application.</p><p>Chrome's \"Create Shortcut\" feature is 90% of the way there, but the \"apps\" it creates have unusual cmd-tab behavior on macOS, so I'm stuck with Electron apps.</p>", 
        "order": "004364106135,004364183101", 
        "who": "James"
    }, 
    {
        "createdAt": "Sun, 28 Apr 2019", 
        "indent": 0, 
        "message": "<p>Hi Ian, we're developing a similar cross platform search similar to the two you have posted above called <a href=\"http://SpeedyTV.com\" rel=\"nofollow noopener\" title=\"SpeedyTV.com\">SpeedyTV.com</a> .  Its in the early stages but we're seeing quite a few folks find it useful as we gain feedback from our users.</p>", 
        "order": "004441910407", 
        "who": "Kerry Fitzgerald"
    }, 
    {
        "createdAt": "Fri, 08 Mar 2019", 
        "indent": 0, 
        "message": "<p>I remember Sidekick :) <br><a href=\"https://en.wikipedia.org/wiki/Borland_Sidekick\" rel=\"nofollow noopener\" title=\"https://en.wikipedia.org/wiki/Borland_Sidekick\">https://en.wikipedia.org/wi...</a></p>", 
        "order": "004370067146", 
        "who": "drewpca"
    }
]