[
    {
        "createdAt": "Thu, 23 Jul 2015", 
        "indent": 0, 
        "message": "<p>I am so glad I found this via @loppear.</p><p>I would agree that in talking about annotation we often skip the important question -- how do people get smarter about things?</p><p>Ultimately, the sign of intelligence isn't coming to the right answer or even listening to the views of others. Expert knowledge is most categorized by the ability of the expert to hold multiple conflicting and fuzzily related ideas, examples, theories, and data in ones head in a probabilistic way so that as new things come in they don't have to be accepted of rejected -- just appropriately connected and weighted.</p><p>The adversarial assumptions that lie under much annotation -- may the best idea win, you are right on these three points, wrong on these four, this is what my problems are with cat pics, BUT WHAT ABOUT JADE HELM, why did you write something in your niche area of concern that is not in my niche area of concern -- these don't feel to me like the way we grow.</p><p>When we start with how we grow personally -- what would mind-expanding *personal* annotation look like -- you're right, we get to a much different vision. I think linking is a form that is underrated, and I also think that we have to learn to write things in small, linkable ways that get beyond conversation and persuasion:</p><p><a href=\"http://hapgood.us/2015/07/22/follow-up-reader-as-link-author/\" rel=\"nofollow noopener\" title=\"http://hapgood.us/2015/07/22/follow-up-reader-as-link-author/\">http://hapgood.us/2015/07/2...</a></p><p>And as you note, these annotations first and foremost have to be personal but shareable, and NOT about persuasion, or consensus. Annotation at its best is a note that says \"Here's what I have to remember when I look at this. E.g. a link, a conflicting number, whatever. And if the page is completely wrong and unuseful to you, don't annotate. That's just flame wars by a different name.</p>", 
        "order": "002153356547", 
        "who": "hapgood"
    }
]