[
    {
        "createdAt": "Tue, 20 Jan 2015", 
        "indent": 1, 
        "message": "<p>Very interesting!  I just emailed the contact link there (which maybe is you, I can't quite tell ;)</p>", 
        "order": "001802573279,001804969703", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Fri, 16 Jan 2015", 
        "indent": 2, 
        "message": "<p>Ah, then, much better :)</p>", 
        "order": "001795193923,001795284347,001795287284", 
        "who": "Christopher Mahan"
    }, 
    {
        "createdAt": "Mon, 19 Jan 2015", 
        "indent": 0, 
        "message": "<p>&gt; because I think it’s a really good trick: make a static copy of the live DOM</p><p>I've done a bunch of this myself; excited to see what you release. Did I already tell you about / have you already seen <a href=\"http://archive.today?\" rel=\"nofollow noopener\" title=\"http://archive.today?\">http://archive.today?</a></p>", 
        "order": "001802573279", 
        "who": "Josh"
    }, 
    {
        "createdAt": "Fri, 16 Jan 2015", 
        "indent": 0, 
        "message": "<p>I think the \"upload it somewhere with a URL\" is gonna be the hard part. Most people can manage copy and paste at best, and \"share this\" buttons are just easiest.</p><p>I've resorted to the links page at <a href=\"http://christophermahan.com/links/\" rel=\"nofollow noopener\" title=\"http://christophermahan.com/links/\">http://christophermahan.com...</a> and it's a pita to update. I ssh/nano into server, paste the url twice, type html, etc. It's brutal and I can't see anyone else I know doing it. I know debian linux, dns, hosting well enough to make it work, but that's a dying art.</p><p>I think if Mozilla made a S3 type hosting and the editor was directly in Firefox, and you could just drag and drop, compose if you will, on split screen (left 1/3 your page, right 2/3 your tabs and you could go from tab to tab and just drag stuff right into your page, click save, and presto it's on the web, at <a href=\"http://myname.mozcloud.org/2015-01-15/some-post-name-title-thingy\" rel=\"nofollow noopener\" title=\"myname.mozcloud.org/2015-01-15/some-post-name-title-thingy\">myname.mozcloud.org/2015-01...</a> and there's a button right there to \"share to twitter/facebook/google+\" then nobody would want to use the admin section of any blogging platform to write their posts.</p><p>I use firefox on all my computers (although, at work, they make it really, really hard and I'm using IE9 Gaaah), I uninstalled it on my mobile after trying for 2 years because the \"reading\" mode was missing sentences on my own website even though that validates html5 (xhtml-mode).</p><p>I used to use the website editor in netscape communicator. I'm not asking you to build an html editor. I'm asking for a blog post/essay post/article post editor in FF that can save to the web automagically. I think people will really dig that, and would probably trust it better than the Microsoft-owned wordpress, Yahoo-tumbler, or Gmail's blogpost, although those are getting plenty of people using them.</p><p>Also, make a kickass writing platform for writers, (people who write books. stories) and completely automate publishing to PDF, EPUB, HTML, RTF, MSWORD(?) , .odf, Kindle, but also work with amazon's createspace and other on-demand book platforms to automate that process, and you'll get traction there. Everyone wants to be a writer, and if you become the free, good, easy tool, that would get you lots of people. (work with Amazon, perhaps, push direc to kindle?)</p><p>That should be doable with existing resources, no?</p><p>Last but not least, work with the VLC team to incorporate a good audio/video creation tool for youtube/others?</p><p>You have to make yourselves better, and go where chrome doesn't want to go, because they don't really want to put all that energy into managing a widely divergent fork of chromium.</p><p>Take the browser to the next level. Make firefox the web platform, not just the web browser.</p><p>Let the other browsers play catch-up with you.</p><p>Forget the tablets/phones for now with Firefox. Go after content creators. They all use real computers. Make it snappy on laptops, make it awesome on macbook air. If you can be the \"app of choice\" on Macbook air for content creators, the mac fans will push each other to get it, no worries about that.</p><p>Make people want to be with firefox because of the Why. (see <a href=\"http://christophermahan.com/links/#14)\" rel=\"nofollow noopener\" title=\"http://christophermahan.com/links/#14)\">http://christophermahan.com...</a></p><p>Here's your next slogan \"Firefox: Make the Web, Remake the World.\"</p><p>Do it!</p>", 
        "order": "001795193923", 
        "who": "Christopher Mahan"
    }, 
    {
        "createdAt": "Tue, 20 Jan 2015", 
        "indent": 3, 
        "message": "<p>One of the two authors does work at Mozilla, but there's a lot going on, it's hard to keep track.  Documenting things publicly will probably help as in this case ;)</p>", 
        "order": "001795403428,001795973790,001802730924,001804964457", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Mon, 19 Jan 2015", 
        "indent": 2, 
        "message": "<p>Ehm, left hand meet right hand! Don't both you and authors of MAFF work for Mozilla? :)</p>", 
        "order": "001795403428,001795973790,001802730924", 
        "who": "mcepl"
    }, 
    {
        "createdAt": "Fri, 16 Jan 2015", 
        "indent": 1, 
        "message": "<p>It didn't relate to MAF because I hadn't heard of it before, but now I have!  I put a note about it on this ticket: <a href=\"https://github.com/ianb/pageshot/issues/88\" rel=\"nofollow noopener\" title=\"https://github.com/ianb/pageshot/issues/88\">https://github.com/ianb/pag...</a> – if you have any other thoughts about it, it would be great to add to them there.</p>", 
        "order": "001795403428,001795973790", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Fri, 16 Jan 2015", 
        "indent": 1, 
        "message": "<p>Just to clarify: the result would be automatically uploaded to a Mozilla-hosted service, I certainly wouldn't want to put someone through the process of moving it to some hosting of their own.  Plus there's lots of interesting things we can do and tools we can provide once we upload that content.</p>", 
        "order": "001795193923,001795284347", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Sat, 17 Jan 2015", 
        "indent": 0, 
        "message": "<p>I wrote something like this with a few other people back in 2008. It was called giftag. BestBuy funded it for a while but they didn't ever really try to develop it. Eventually they pulled the plug long after I left.</p>", 
        "order": "001797880814", 
        "who": "nickbauman"
    }, 
    {
        "createdAt": "Fri, 16 Jan 2015", 
        "indent": 0, 
        "message": "<p>How does it relate to <a href=\"http://maf.mozdev.org/\" rel=\"nofollow noopener\" title=\"http://maf.mozdev.org/\">http://maf.mozdev.org/</a> … I have created a converter to MAFF (<a href=\"https://pypi.python.org/pypi/war2maff/)\" rel=\"nofollow noopener\" title=\"https://pypi.python.org/pypi/war2maff/)\">https://pypi.python.org/pyp...</a>, so I am hopeful the format is not going to die anytime soon?</p>", 
        "order": "001795403428", 
        "who": "mcepl"
    }
]