[
    {
        "createdAt": "Tue, 05 May 2015", 
        "indent": 1, 
        "message": "<p>The shot is uploaded to a server, at a hard-to-guess URL.  That page on the server contains the clips you've made at the top, and then the full page below, with the ability to navigate to those clips inline.  You need Firefox (and the addon) to create a shot, but you can view the shot on any browser.</p><p>Right now we don't have any access control except that you shouldn't share the link except to someone you want to see it.  So you can give the link to any service and it can fetch it and get all the metadata.  The page is an HTML document, but also well formed and the analyzing software is sure to see the same thing the user sees.  The clips are images or text, but in the case of images we also determine the text most likely contained in the image, so you could still do things like text search across those image clips.</p><p>I've thought it would be nice if there was an API where you could ask a service be informed about all or some of your shots.  Then you could automatically send all that information on to someone else.  To make it a bit more interesting, that service could then add its own annotations.  E.g., a word count app could accept shots, do a word count, then add that count as an annotation.  Right now each tidbit of information shows up as a clip or comment, but if other use cases emerge I'm sure we could find more appropriate ways to find other information.  Maybe another example of a tool that could be used this way: <a href=\"https://github.com/mozilla-services/pageshot/issues/356\" rel=\"nofollow noopener\" title=\"https://github.com/mozilla-services/pageshot/issues/356\">https://github.com/mozilla-...</a> – you can imagine reverse image search or other \"detective\" tools being applied to a web page.</p><p>Of course it's annoying to setup third-party services to do little annotations, so I also wonder if there's opportunities to have community-provided analysis tools that can run locally or on our servers.  I have to poke around more to find out about the state of the art in Javascript sandboxing.</p>", 
        "order": "001988402331,002005792138", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Sun, 26 Apr 2015", 
        "indent": 0, 
        "message": "<p>This sounds like a powerful tool to me as a teacher. Help me to better see this product/idea, please. Where is this PageShot stored? Is it an html file on one's file system (w/info on both the whole page and the exact area selected)? What applications are able to view it? How does one share it? Additionally, would it be 'easy' to build meta tools to analyze the content of the pageshot (such as a word count/wordle tool? maybe I'm asking about an api?)</p>", 
        "order": "001988402331", 
        "who": "David Groos"
    }, 
    {
        "createdAt": "Fri, 24 Apr 2015", 
        "indent": 0, 
        "message": "<p>If I am understanding right, PageShot is a web clipper tool with sharing feature built in?  As firefox is landing the reading list feature, maybe this is a good chance to integrate this tool with it by allowing users to insert page shots into the reading list and share them.</p>", 
        "order": "001984619482", 
        "who": "mr_raindrop"
    }
]