[
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 0, 
        "message": "<p>Nice: \"Failure isn’t okay, we don’t achieve things through Brownian motion and a selection function.\"</p><p>Also nice: \"I’ve had this notion in my mind of the Ultimate Product, some great thing I’m going to come up with and then make in some series of late-night coding frenzies, and it’ll be amazing.\"</p><p>I've long been there, having seen friends on the internets do the same thing to great effect. But, I think I'm starting to realize that spinning off one half-finished Ultimate Product after another is just how I learn all the new things. Maybe someday I'll have something that catches, but I'm becoming convinced that my serial enthusiasm won't let it happen.</p>", 
        "order": "001593058782", 
        "who": "Les Orchard"
    }, 
    {
        "createdAt": "Sat, 20 Sep 2014", 
        "indent": 0, 
        "message": "<p>Powerful writings, thanks for sharing your 'grace' </p>", 
        "order": "001597782120", 
        "who": "Diane Mueller"
    }, 
    {
        "createdAt": "Tue, 16 Sep 2014", 
        "indent": 0, 
        "message": "<p>From the way you write about management, i surely can say that being part of your team would not be bad at all. I think they are good thoughts and opinions.Greetings and good luck!</p>", 
        "order": "001591051910", 
        "who": "Marcel Hekking"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 1, 
        "message": "<p>I mean that the product that is Firefox has a clear lineage going back to the commercial product produced by Netscape.</p>", 
        "order": "001593495306,001593504397", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Fri, 19 Sep 2014", 
        "indent": 3, 
        "message": "<p>Yeah, FWIW, this was like a light-bulb-over-head phrase for me a few years ago. <a href=\"http://decafbad.com/blog/2006/05/26/confessions-of-a-serial-enthusiast/\" rel=\"nofollow noopener\" title=\"http://decafbad.com/blog/2006/05/26/confessions-of-a-serial-enthusiast/\">http://decafbad.com/blog/20...</a></p>", 
        "order": "001593058782,001593469378,001596136153,001596158204", 
        "who": "Les Orchard"
    }, 
    {
        "createdAt": "Fri, 19 Sep 2014", 
        "indent": 2, 
        "message": "<p>That makes three of us. \"Serial enthusiasm\". I love it.</p>", 
        "order": "001593058782,001593469378,001596136153", 
        "who": "Russell Leggett"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 2, 
        "message": "<p>OK. I'd replace \"product\" with \"code\" to make that more true. The product of Netscape, not so much.</p><p>One of the most important points about the creation of m/b (which became Phoenix which became Firefox) was that it wasn't chasing Netscape users like other Netscape/Mozilla efforts at the time, and it didn't try in any way to be a Netscape product or an upgrade or replacement for Netscape products. We were after IE users.</p><p>I'd say that Firefox, as a product, owes as much to IE and Netcaptor as it does to Netscape, perhaps more.</p><p>Alternatively, your statement could simply apply to all browsers released after Netscape. \"Even IE was in some sense really created by Netscape\" would be equally valid since IE was basically a Netscape clone.  Heck as far as that goes, \"Even Firefox was in some sense really created by Netscape\" could be replaced by \"Even Chrome was really created by Apple\" since Chrome was built on much of Apple's tech just like we built Firefox on Mozilla/Netscape tech.</p><p>But a product is not code and Firefox was a product (and project) that had very little to do with Netscape.</p><p>Simply put, Firefox was not a Netscape product. It was the product of a small group of *independent* people, some Netscape employees (and later former employees) and some not, who wanted to take on and beat IE *despite* the existence of a Netscape that didn't care about it, didn't invest in it, and certainly didn't design it.</p><p>But yes, Firefox did use a lot of Mozilla/Netscape code.</p>", 
        "order": "001593495306,001593504397,001593547810", 
        "who": "Asa Dotzler"
    }, 
    {
        "createdAt": "Sat, 20 Sep 2014", 
        "indent": 0, 
        "message": "<p>This was such an awesome post that it deserves to be three or four posts, each one hitting a single concept hard, but I'm also grateful that you did decide to do it as one post, because I understand the need to pull all the various thoughts, feelings, concepts together in one place.</p><p>Agree the \"fail fast\" trope is overhyped and only makes sense when you can realize clear takeaways. OTOH, you can only \"fail\" when you have clear goals, some clear yardstick of success. So to the extent it helps concretize goals/yardsticks up front, failing often/fast can be valuable, but again only if the lessons of failure can be communicated and utilized.</p>", 
        "order": "001597882227", 
        "who": "Kas Thomas"
    }, 
    {
        "createdAt": "Fri, 19 Sep 2014", 
        "indent": 4, 
        "message": "<p>Oh darn, you fixed your Freudian typo of \"a few tears ago\"...</p>", 
        "order": "001593058782,001593469378,001596136153,001596158204,001596420874", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Thu, 18 Sep 2014", 
        "indent": 0, 
        "message": "<p>I think the reason open-source projects aren't great at churning out products (or \"finishing\" them, as you so astutely word it—in the sense of \"polishing\") is that the things that are interesting to work on are orthogonal to the things that make a good product.</p><p>The advantage a hierarchal organization brings to product creation is focus. It's what I enjoy about Apple: sometimes their products aren't for me, but they're always *coherent*. I can see what they were going for. The Apple suite of apps are clearly the best browser, calendar, and mailer for Steve Jobs.</p><p>Likewise, Safari has one focus. It is the browser most at home on the Mac.</p><p>Chrome has one focus. It is the best way to consume Google services.</p><p>Firefox is all over the place right now. Do we provide the best privacy? The best dev tools? The most ambitious web standards? The best integration with our phone? What? We're smart people, each in our area. But being an open source project at heart predisposes us to being a collection of each smart person's favorite features, duct-taped together and given a version number. It's what MS Word was around version 6 (and may still be for all I know): MS managed that project by having each developer come up with and be responsible for his or her own pet feature.</p><p>Don't get me wrong—I love and use a lot of FF features—but it seems like we're throwing things at the wall lately: a Hello button, Panorama, F1, a Social API. Now, I love Hello; I use it all the time. And I think better browser integration with Facebook is a motivating feature that could really net us some users. But I look at Firefox today, and I don't see focus. Who does Firefox want to be the Best Browser for? I have no idea. A Single Guiding Principle would both (1) prioritize our efforts so we can actually complete, polish, ship and support things rather than tossing them behind a toolbar button and forgetting about them and (2) unify our messaging so people know why, beyond a shadow of a doubt, to choose Firefox.</p><p>As for messaging, the \"Doing good is part of our code\" campaign made me proud to work for Mozilla, but it also took me back to Apple's darkest days, when they were putting up billboards saying \"Give your dreams a chance.\" \"Please, guys, don't leave us! Give us another chance!\" Emotional appeals work for soft drinks where there is no product differentiation. But we're not there with browsers yet; there are important differences. In Apple's case, they brought Chiat/Day back onboard, started running some messaging that had teeth, started attacking their competitors directly, and sold themselves to Steve for -$400M, who promptly focused them by cancelling half their product line and doing ballsy things like eliminating floppy drives. The rest is history. They added good UI to music players. Maybe we add privacy to phones. I don't know. But we need to figure it out.</p>", 
        "order": "001594854754", 
        "who": "Erik Rose"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 0, 
        "message": "<p>Amazing post, thanks for sharing, Ian. Especially the \"Some of what I’ve learned\" section, I've had extremely similar realizations. I am also struggling with a similar self-acknowledged fantasy, but not sure how willing I am to give it up anymore (prior attempts were less than fruitful).</p><p>Also I very-agree to your assessment that it should not be the manager's role to hide stresses and confusion from the team. Noise, sure. But when \"real life\" doesn't make it to the core team, information is lost and incorrect decisions are made. Even if real life means politics and uncertainty.</p><p>Good luck on your new role, I'm sure you'll do an amazing job. :)</p>", 
        "order": "001592569897", 
        "who": "Andrey Petrov"
    }, 
    {
        "createdAt": "Tue, 16 Sep 2014", 
        "indent": 0, 
        "message": "<p>Good luck!</p>", 
        "order": "001591034578", 
        "who": "Tavis Rudd"
    }, 
    {
        "createdAt": "Tue, 30 Sep 2014", 
        "indent": 0, 
        "message": "<p>&gt; \"My primary concern is to help the members of my team do their most impactful work. This is not the same as their best work. Over time I am seeing that these are greatly different\"</p><p>Can you expand on this please Ian? I am not clear why the two would be different.</p><p>&gt; and I think the open source world is almost built on “best” over “impactful”\"</p><p>I agree with this - we build technologically superb pieces which are impossible to use and make little impact.</p>", 
        "order": "001613739917", 
        "who": "Peter Bowyer"
    }, 
    {
        "createdAt": "Tue, 23 Sep 2014", 
        "indent": 0, 
        "message": "<p>\"That said, management is a group’s conduit to the larger organization. Individuals can reach out, but it’s harder, and the information they acquire doesn’t necessarily percolate well through the group. Advocacy by individual contributors is also often misdirected, chasing after support where there is no real potential. \"</p><p>Simple writing is really not your thing.</p>", 
        "order": "001601684977", 
        "who": "Kaerber"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 3, 
        "message": "<p>It was only an aside – Firefox is quite notable among a very very small list of successful consumer open source products.  I'm not entirely sure why it's so hard for open source projects to produce a product.  Some of it is the challenge of actually defining and executing on a product vision, when the work is done by volunteers with independent motivations, and often not a sufficiently diverse set of skills.  Firefox notably got beyond that.</p><p>But I also suspect one of the challenges that open source projects have is organizations (or lack thereof) that support the product development – there is some wisdom in traditional corporate structures, and they support certain kinds of efforts that are hard to achieve without those structures.  There was a lot of corporate effort that helped get early Firefox/Phoenix developers within shooting distance of a product.</p><p>Chrome is interesting as a kind of inverted example: the kind of code that Netscape provided to make Firefox possible is what WebKit/Konqueror provided to make Safari and Chrome possible, but it was Google and Apple that turned it into a successful product.  Go figure.</p>", 
        "order": "001593495306,001593504397,001593547810,001593577978", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Fri, 19 Sep 2014", 
        "indent": 0, 
        "message": "<p>\"I hope I can muster the will to write more about what I learn along the way\"</p><p>I hope so too, they're bound to be interesting, just like this one. Good luck</p>", 
        "order": "001596942231", 
        "who": "Catalin Iacob"
    }, 
    {
        "createdAt": "Sat, 22 Nov 2014", 
        "indent": 0, 
        "message": "<p>I came across this post only recently. Good luck with everything Ian, it was a great pleasure working with you!</p>", 
        "order": "001707409312", 
        "who": "Howon Song"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 0, 
        "message": "<p>\"Even Firefox was in some sense really created by Netscape.\"  As one of the people that created Firefox, I'm curious to hear more on what you mean by that.</p>", 
        "order": "001593495306", 
        "who": "Asa Dotzler"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 0, 
        "message": "<p>\"When I first started writing this I felt that a leadership misdirection was at the root of Labs’ missteps. But leadership fetish feels a lot like a Great Man theory...\"</p><p>Great management cannot guarantee success any more than enough money to pay the engineers can guarantee success. The lack of either one can, if it is bad enough, guarantee failure.</p>", 
        "order": "001592992004", 
        "who": "fredfnord"
    }, 
    {
        "createdAt": "Wed, 17 Sep 2014", 
        "indent": 1, 
        "message": "<p>I identify so much with this that it's scary.</p>", 
        "order": "001593058782,001593469378", 
        "who": "Xorlev"
    }
]