[
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Your contributions to python have been extremely important.  Thanks for all the good work, and best wishes.</p>", 
        "order": "001241601353", 
        "who": "batok"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 2, 
        "message": "<p><a href=\"http://www.trypython.org/\" rel=\"nofollow noopener\" title=\"http://www.trypython.org/\">http://www.trypython.org/</a></p>", 
        "order": "001242261561,001242477663,001242864364", 
        "who": "Xiong Chiamiov"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thank you so much for this soulful and inspiring  article.</p><p>Coding _is_ creating, and obviously you are a great creator. Please do not stop your search. It seems JavaScript still is not your perfect place. There _is_ such a thing as joy in coding, as a continuous, cheerful enthusiasm for this craft.</p><p>You mentioned the \"10,000 hours\" factor (I believe I read that on Peter Norvig's \"Teach Yourself Programming in Ten Years\"), JavaScript, and how you value (rightfully so) a good, closely knit community.</p><p>Please consider to spend some time with Common Lisp. It has a very nice community (best experienced live), and very close connection to JavaScript as well (see ParenScript: <a href=\"http://common-lisp.net/projects/parenscript)\" rel=\"nofollow noopener\" title=\"http://common-lisp.net/projects/parenscript)\">http://common-lisp.net/proj...</a>. Its power, i.e. creative power, are second to none. Please, don't take my or anybody's words for it. Just give it a try. The closest one can find to real joy in programming can definitely be found in Lisp.</p><p>Why don't you check it out at the next (7th) European Lisp Symposium?<br><a href=\"http://www.european-lisp-symposium.org/\" rel=\"nofollow noopener\" title=\"http://www.european-lisp-symposium.org/\">http://www.european-lisp-sy...</a></p><p>I just feel you would be an outstanding creator with Common Lisp, and you are getting so much closer to it now.</p><p>Thank you!</p><p>PS: <a href=\"http://replove.herokuapp.com/\" rel=\"nofollow noopener\" title=\"http://replove.herokuapp.com/\">http://replove.herokuapp.com/</a></p>", 
        "order": "001243281770", 
        "who": "SiroDacia"
    }, 
    {
        "createdAt": "Mon, 17 Feb 2014", 
        "indent": 6, 
        "message": "<p>Brython is an interesting attempt - and a great jumping off point. This is an idea that I'm extremely interested in doing. But instead of, like Brython trying to pretend that the Python is part of the HTML, basically just a Python VM in Javascript. Effectively think Pypy, but instead more like PyJs. Or JsPy - as I like to pronounce it, \"Jaspy\". Actually I started a repository a while ago but apparently deleted it. So I made a new one: <a href=\"https://github.com/waynew/jspy\" rel=\"nofollow noopener\" title=\"https://github.com/waynew/jspy\">https://github.com/waynew/jspy</a></p><p>Obviously there are a few things that you wouldn't be able to mimic, and maybe the speed would suck, but I find the concept incredibly interesting... and useful for some of the projects I have in my mind. I haven't run out of Python things yet ;)</p><p>And to Ian - yes, until we meet again!</p>", 
        "order": "001242261561,001242477663,001242864364,001243769025,001244017747,001244063768,001247500271", 
        "who": "waynewerner"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Apart from all the good I can say... moving from language with standards and PEPs, perfect syntax and readability, warm community, to the language with no normal OOP, semicolons, brackets all around, horrible Crawford-driven linting and community that rarely goes anywhere further from JS (JavaScript. JavaScript Everywhere meme!). Well, sorry. I don't think Python guys truly support or understand that.</p>", 
        "order": "001242261561", 
        "who": "Andrey Shipilov"
    }, 
    {
        "createdAt": "Fri, 25 Apr 2014", 
        "indent": 1, 
        "message": "<p>...or Clojure and ClojureScript. That community feels like it has more of a BDFL (Rich Hickey) vibe to it, supported by luminaries analogous to Tim Something-with-many-dashes-that-I-don't-know-how-to-emulate-ly Peters, Andrew Kuchling, some guy who works at Mozilla and just recently took on a huge responsibility, and so on... I haven't gotten very far in, yet, and I still use Python on the back end, but I'm pretty sure Clojure is where I'll put my next 10k hours.</p>", 
        "order": "001243281770,001355886556", 
        "who": "tripplilley"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>You realize there's these things out there called \"concluding paragraphs\", right? They are usually found at the bottom of the article. You might just want to stick to those if you're too lazy to actually read things instead of insulting someone for taking the time make some thoughtful remarks about his choices in programming.</p>", 
        "order": "001242019662,001242405586", 
        "who": "Zoologist_Extraordinaire"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Well said. I'd also venture that it tracks the development of a programmer (or builder, or whatever description you prefer); feeling that you're developed in an area in a way that makes it less exciting, and moving to other areas that get the juices flowing. It can happen with languages, methodologies, technical focus (e.g. user-facing web vs. OS kernel ), even business areas.</p>", 
        "order": "001242454142", 
        "who": "orip"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 3, 
        "message": "<p>Yeah, somebody already suggested Brython - it's very cool, even supports HTML5 :)</p><p>Why is it an awful argument? You could get away with a JS interpreter for Python like Brython for small projects, but if you're making a game or something demanding, JS is the only way to go.</p>", 
        "order": "001242261561,001242477663,001251221513,001251233839", 
        "who": "Psion Ski"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 1, 
        "message": "<p>if the Python Community was just a Computer Science Club then I wouldn't have had much interest in it.  If you had just wanted to use Python as a tool that would be fine, and none of the community standards or any other stuff comes with Python-the-tool.  Since I have a hard time imagining that any of these efforts had any material impact on you, I suspect that you are just fishing for reasons to feel some sense of righteous indignation.</p>", 
        "order": "001250696109,001251173456", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Your words are truly inspiring, and for someone (among the many) who uses tools build by you on a daily basis, I only have this to say. Python is what it is 'cause of people like you, and I hope that us and the future generations of Pythonistas can make you proud and build beautiful and useful things.</p>", 
        "order": "001241765629", 
        "who": "cmllamacho"
    }, 
    {
        "createdAt": "Mon, 17 Feb 2014", 
        "indent": 0, 
        "message": "<p>pip &amp; virtualenv ROCK, thank you for those tools!</p>", 
        "order": "001247717538", 
        "who": "Michał Pasternak"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Hey Ian, thanks for writing this post. I've always enjoyed your work and watching you do it.</p><p>I've gone through a similar transition in the last few years myself. I like to call myself a creative developer. I have been a web developer for about as long as I've been a Python developer. And where the creativity is at these days is on the client side more so than the server side, so that's where I went.</p><p>Back before I even heard of Backbone let alone the wave of Angular and Ember and React and such, I started Obviel, which was to me a fascinating exercise in porting sever-side web framework concepts to the client and seeing what happens. It hasn't gained much traction, but I learned a lot, and I think there are some ideas in there that I want to do more with.</p><p>Strangely enough I find myself back writing Python code again, trying to express what I've learned about web frameworks in a last 15 years or so in a compact form, Morepath. I'm excited about it. But I expect I'll be pulled back to the client again soon, and there are ideas I want to explore, so that is good. And Morepath is a web framework that intends to serve the modern rich-client web application that I've gained much experience over the last years.</p><p>I've found it hard to find a clear community in the JavaScript world myself; it's a more multi-polar world than Python, but ideas do spread through it. I greatly enjoyed <a href=\"http://JSConf.eu\" rel=\"nofollow noopener\" title=\"JSConf.eu\">JSConf.eu</a> last year however. Perhaps we will, indeed, meet again sometime. I hope so!</p>", 
        "order": "001242682909", 
        "who": "faassen"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>That was cold, but i agree.</p>", 
        "order": "001242019662,001242112818", 
        "who": "Jesus Bejarano"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Although I was never as much of a pythonista as you Ian, I too have made the same transition. It is not an easy thing leaving a comfortable paradigm to explore. I salut you for doing so, and for saying so, making me feel not quite so alone in this here boat.</p><p>I also want to thank you for all your amazing python work and for the tools that made my life easier! I especially want to thank you for WebOb which inspired me to build my own framework(s) and pushed me to a new level of interest and understanding of both the web and software stacks in general.</p><p>Thanks for all the fish, and good luck!</p>", 
        "order": "001242506744", 
        "who": "asbjornenge"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thanks for sharing your experience...</p><p>What about coding in brython (<a href=\"http://www.brython.info/)\" rel=\"nofollow noopener\" title=\"http://www.brython.info/)\">http://www.brython.info/)</a>, or maybe working to bring python to the browsers (to replace or complement JS)?</p>", 
        "order": "001242815781", 
        "who": "compiler"
    }, 
    {
        "createdAt": "Thu, 10 Apr 2014", 
        "indent": 1, 
        "message": "<p>I am not particularly fond of Node.js, though for some real-time stuff it has advantages.  Mostly I've been deemphasizing the server in my work and concepts, going out of my way to keep logic on the client.  I've really enjoyed creating and using minimalistic servers that don't need to be updated to extend the functionality of a project.</p>", 
        "order": "001330412343,001330419263", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thanks for sharing, Ian. And thanks for being a great source of inspiration for the Python community and contributing so much really useful stuff that nobody else wanted to tackle.</p>", 
        "order": "001242966105", 
        "who": "Citolino"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 5, 
        "message": "<p>Now that's more like it! :D Bookmarked, awesome!</p>", 
        "order": "001242261561,001242477663,001242864364,001243769025,001244017747,001244063768", 
        "who": "Psion Ski"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>In some ways you started me on the path to finding the Python community. Thank you for your work and inspiration.  Your writing and programming both had a level of accuracy and maturity that was refreshing.  Which, as I soon found out, mirrored the Python community as a whole.  I hope and believe you can bring this to JavaScript and the browser platform.</p>", 
        "order": "001242298602", 
        "who": "Ian Wilson"
    }, 
    {
        "createdAt": "Sat, 22 Feb 2014", 
        "indent": 3, 
        "message": "<p>Well……in Chinese,“永垂不朽” means a great man died, here it's a kind of wisecrack. And the \"笑尿了\" means a man laugh too deep that to control himself, it's for the \"永垂不朽\"……</p>", 
        "order": "001242475092,001243578064,001251170156,001256112926", 
        "who": "magine"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 0, 
        "message": "<p>It's kind of sad to see you say \"goodbye, Python\", but I've never felt that language partisanship should peg us down to one place, be it a community, a job, or whatever, so I can't just but wish you all the luck. You've been an inspiration for many years and that will always be appreciated.</p>", 
        "order": "001243864267", 
        "who": "R. C."
    }, 
    {
        "createdAt": "Tue, 18 Feb 2014", 
        "indent": 0, 
        "message": "<p>You created a legacy. We use your<br>tools everyday. An army of Pythonistas maintain and improve your various creations.</p><p>I think that you are welcome back if you ever want to, but if you don't, that's cool too. You have left your mark. </p>", 
        "order": "001250299514", 
        "who": "MarcAbramowitz"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thank you for all of your contributions and a very thoughtful post, Ian. After seven years of doing the lion's share of my coding in Python, working in Javascript on the IPython Notebook in the last few months has made me face similar sobering realizations. It's humbling to start afresh and wade through new sets of challenges.</p><p>I'm saddened to hear that you haven't found the JS community yet, either. My guess is that, over time, there will be enough Pythonista ex-pats and dual citizens to make `bower install community` a reality. Community matters in a way that transgresses our tools, languages, operating systems. Connections between people strengthen the technical ecosystem, not the other way around.</p><p>As one small anecdote, for our part, the JavaScript portion of the IPython Notebook uses PEP 8's `lower_case_with_underscores` naming convention in defiance of JavaScript's camelCasing - just to help us feel a little more at home :) and to keep track of what's ours and what's external.</p>", 
        "order": "001241712843", 
        "who": "Paul Ivanov"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>You were one of those who inspired me. Thanks for all your great work!</p>", 
        "order": "001242034871", 
        "who": "Diógenes A. Fernandes Hermínio"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>You know you are one of those who got me interested in Python. Whole of the Python community is waiting for your return :).</p>", 
        "order": "001241581597", 
        "who": "M Yasoob Khalid"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>You and your work will always be a huge inspiration to me and to the world, whether in Python, JavaScript, or in life. I look forward to whatever you create next.</p>", 
        "order": "001241574692", 
        "who": "audreyr"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>So you dumped Pyhon in favour of Javascript but you don't have the guts to admit that Javascript is the inferior language, so you had to write this much to defend your move - weak man, very weak. I don't use pyhon, I use ruby, but if I would be a python user I would call it a good thing that you went away from the language, just as I think it is good that zed shaw moved away from ruby. Languages do not need to have everyone and some people are indeed better doing javascript (lol).</p>", 
        "order": "001242453159", 
        "who": "Markus Heiler"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 2, 
        "message": "<p>Brython. Try that. Although it's an awful argument to say that \"it doesn't run in the browser\".</p>", 
        "order": "001242261561,001242477663,001251221513", 
        "who": "Andrey Shipilov"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 2, 
        "message": "<p>lol</p>", 
        "order": "001242108580,001242379069,001242453961", 
        "who": "Markus Heiler"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>前辈走好，您在我们心中永垂不朽！</p>", 
        "order": "001242475092", 
        "who": "Kailai"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thanks for everything you've contributed to the Python community over the years.</p><p>Couldn't agree more with your comments about mastery and transferability, and about the difficulty (and importance) of mastering \"how to negotiate between feasibility and user value, how to negotiate compromises in strategy and design.\"</p><p>Hope to still see you around sometime!</p>", 
        "order": "001241603909", 
        "who": "Carl Meyer"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Welcome to the fall of Python. I can hear all young amateur pythoners <br>crying because its toy language was criticized. Always the same history <br>with fashion languages. Besides, I found Python community one of the <br>most agressive closed-mind and negative about criticism. They simply cannot admit <br>something is wrong about its choice.<br>On the other hand, Smalltalk <br>community preserves its humility and great quality through the years by <br>having a colossal developer selection process: Becoming an Smalltalker <br>requires great dedication, deep knowledge of object-orientation and <br>great modelling. And by the way, Smalltalk has a new implementation <br>called Pharo which is making great success lately, you should check it <br>out.</p>", 
        "order": "001242631863", 
        "who": "Veronica Schroeder"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 4, 
        "message": "<p>What about <a href=\"http://www.brython.info\" rel=\"nofollow noopener\" title=\"http://www.brython.info\">http://www.brython.info</a> ?</p>", 
        "order": "001242261561,001242477663,001242864364,001243769025,001244017747", 
        "who": "compiler"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 0, 
        "message": "<p>Paste was one of the biggest influences on my perception of web application infrastructure, and I was a heavy user of WebOb. I'm now in Ruby and JavaScript/browser land myself—welcome! And thanks for all the fish.</p>", 
        "order": "001243952344", 
        "who": "Samuel Cochran"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 1, 
        "message": "<p>笑尿了，给个好评</p>", 
        "order": "001242475092,001243578064", 
        "who": "Liu Bo"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 1, 
        "message": "<p>I'm sorry dude.  Maybe my upvote will make up for it.</p>", 
        "order": "001242019662,001251174246", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 3, 
        "message": "<p>IMHO, the difference with his comment over yours is that, he didn't attack the author, he was just exposing his opinion nothing more.</p>", 
        "order": "001242019662,001242112818,001242453571,001242508256", 
        "who": "Jesus Bejarano"
    }, 
    {
        "createdAt": "Thu, 13 Mar 2014", 
        "indent": 0, 
        "message": "<p>I read it and it was worth it! Your contributions have been inspirational to Python and open source in general. I think what you're touching on is that developers, not languages, are the community.  People are what matters, not the tech under the hood. Those relationships last a lifetime and will be remembered more than any syntax no matter how many hours of mastery you sought in seeking perfection.</p>", 
        "order": "001282388722", 
        "who": "Steven Leggett"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>What a pity that somebody held you down and forced you to read a post on somebody's personal blog!</p>", 
        "order": "001242019662,001242912965", 
        "who": "thither"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>\"stay hungry, stay foolish\"????... you've made a lot of awesome things, now go and have some fun... run Ian Run!</p>", 
        "order": "001242702835", 
        "who": "Ensei Tankado"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Python will miss you, thanks for your contribution to Python community :D</p>", 
        "order": "001242238803", 
        "who": "littleq0903"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 2, 
        "message": "<p>We can see the concluding paragraph just well and nothing in it invalidates the statement made by digler99 in any way.</p>", 
        "order": "001242019662,001242405586,001242453823", 
        "who": "Markus Heiler"
    }, 
    {
        "createdAt": "Mon, 17 Feb 2014", 
        "indent": 2, 
        "message": "<p>尿吧，尿吧。。。</p>", 
        "order": "001242475092,001243578064,001247498545", 
        "who": "Cucole Lee"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>If you want to develop for the web, there is only one way: Javascript<br>(or something which translates to Javascript somehow)</p>", 
        "order": "001242108580,001242379069", 
        "who": "jsaak"
    }, 
    {
        "createdAt": "Tue, 18 Feb 2014", 
        "indent": 1, 
        "message": "<p>永垂不朽</p>", 
        "order": "001242475092,001249225916", 
        "who": "Liam Chen"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 0, 
        "message": "<p>Dear Ian, I come from a completely different world: creative fiction (although I do love to code on the side). However you post made complete sense to me, and I applaud you for walking the new path. Sometimes our medium of expression fails to live up to the way we want to express ourselves, and you have to make a hard choice. Keep making beautiful things, sir - I wish you all the best.</p>", 
        "order": "001244619035", 
        "who": "tashfeen"
    }, 
    {
        "createdAt": "Thu, 27 Feb 2014", 
        "indent": 1, 
        "message": "<p>A terrible loss to the community, I'm sure</p>", 
        "order": "001250696109,001262794349", 
        "who": "Conrad Leonard"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>I was gonna suggest Go to him too.</p>", 
        "order": "001242108580,001242183885", 
        "who": "Andrei Simionescu"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thanks for writing this Ian. The phrase \"right tool for the job\" has always bugged me for similar reasons, but I never nailed it down like you just did. Thanks especially for the care you have put into open source for the Web. I still find it remarkable that either exist at all. Maybe they couldn't exist without each other? They certainly are fragile things that need more people like you to care about them.</p>", 
        "order": "001242422459", 
        "who": "Ed Summers"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thanks for sharing and writing so much great software over the years! I have been on a very similar path and was one of the early Webware users. Now I'm off in node.js land and find it remarkable how different the experience is with node/npm/2014 vs python/(setuptools/pip)/2010. I will never think as highly of javascript as I do of python, but what's happening in the npm world at the moment is amazing.</p>", 
        "order": "001241864365", 
        "who": "Peter Lyons"
    }, 
    {
        "createdAt": "Fri, 25 Apr 2014", 
        "indent": 2, 
        "message": "<p>I downvoted him to cancel yours out. You don't deserve that crap, but you're too good a person to stoop. I am not. :-)</p>", 
        "order": "001242019662,001251174246,001355889934", 
        "who": "tripplilley"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>Python is one of the best languages IMHO, but it doesn't run in the browser.</p><p>P.S. ES6 fixes the OOP issue and the brackets and semicolons can be fixed by writing CoffeeScript (which will also fix the OOP issue for you right now if you don't want to include Traceur or wait for ES6).</p>", 
        "order": "001242261561,001242477663", 
        "who": "Psion Ski"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>I never thought I would see this, but then again, the only real constant is change.</p><p>Best wishes Ian, no matter what paths you take.</p><p>Now stop goofing off, and get back to work!</p>", 
        "order": "001242280673", 
        "who": "Ken Stox"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 2, 
        "message": "<p>Yes, it was cold, but I wrote a similar statement above, and he is simply accurate.</p>", 
        "order": "001242019662,001242112818,001242453571", 
        "who": "Markus Heiler"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Ian, thanks for taking the time to write that up and for all your <br>amazing contributions through the years. I used SQLObject back in the <br>day, and we were probably trying to wring practicality out of PJE's <br>ideas around the same time. :-) I'm so glad you decided to go in search <br>of something that sets your mind on fire rather than fearing the sunk <br>cost, going nowhere, and getting burnt out. I look forward to seeing the<br> excellent things you continue to make!</p>", 
        "order": "001241769282", 
        "who": "Erik Rose"
    }, 
    {
        "createdAt": "Sat, 15 Feb 2014", 
        "indent": 1, 
        "message": "<p>As one who exit'ed the Smalltalk community after 20 years of hard investment, and have been mostly pragmatically pleased with Python as a landing spot, I couldn't disagree with you more. Especially about Pharo. Everytime I download the latest, and play with it, I ask myself \"this is what we threw the commercial smalltalk's out the window for???\"</p><p>To each his own I guess.</p>", 
        "order": "001242631863,001244920197", 
        "who": "Travis Griggs"
    }, 
    {
        "createdAt": "Wed, 12 Feb 2014", 
        "indent": 0, 
        "message": "<p>Javascript seems to be divided into communities that revolve around specific libraries/frameworks rather than the language itself (i.e., prototype, jquery, underscore, knockout, angular, etc.).</p>", 
        "order": "001241836933", 
        "who": "haliphax"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>what a boring read. how many freakin words for you to say you switched from python to javascript ?</p>", 
        "order": "001242019662", 
        "who": "digler99"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>hmm so you're saying you stopped programming Python, and moved to Javascript?  At least Python has many systems and web development libraries and can be used for alot of things.  Not so much for Javascript.  Rather than writing solutions looking for a problem, it's better identify problems and then write the solution for that particular problem.  I'd say there are more people doing Python than Javascript for systems and web tasks.  Also, there are more people doing Perl or C/C++ or PHP or Java than Python and Javascript combined.  If benchmarks are any clue, I would start doing systems development in Go before Python or Javascript.</p>", 
        "order": "001242108580", 
        "who": "PAUL Miller"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>I don't think I truly understood the importance of being part of a technical community until recently. I spent ten years working with Plone. Wherever I happened to be working at the time, I was often contributing code back. I think I learned more from the feedback I got from the community and the architectural discussions with them than anything else.</p><p>Shared experience provides a common set of reference points from which one can discuss technical problems or implementation strategies. Without it those discussions are not nearly as satisfying. Even though I suspect I won't go back to coding Plone again, I know there are many others in that community who are going through similar transitions. I want to see what they're doing now, and tell them about my new experiences. I go to conferences now more for the people and the hallway discussions than the talks.</p><p>I suspect it won't be quite the same, after all we won't be working on the same thing so the possibilities of collaboration are much lower. But I still hope to find some sense of shared experience so we can still learn from each other.</p>", 
        "order": "001242137981", 
        "who": "laurencerowe"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 0, 
        "message": "<p>Ian, thank you for all the work that you've done for Python. You've basically made our lives better. I admire your productivity and it's something I want to emulate. Best of luck with what you're doing next!</p>", 
        "order": "001243839294", 
        "who": "lucianu"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 3, 
        "message": "<p>Interesting link, but didn't work for me (probably some Silverlight issue). Anyway, I was thinking more along the lines of &lt;script type=\"text/python\"&gt; and full DOM integration :) Although minifiying Python won't be easy, but if you can just serve it gzipped...</p>", 
        "order": "001242261561,001242477663,001242864364,001243769025", 
        "who": "Psion Ski"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Honestly, what makes Javascript so popular now is not really because NPM, Nodejs but because you can efficiently run almost 100% percent javascript (with the exception of html and css). Several databases has javascript as their REPL and stores things in JSON or JSON-like objects. You no longer need to import som json parsing library since everything is already javascript.</p><p>Too bad the language suck so much more than Python. I think a really easy to use Python to JS compiler would be good for the Python Community. You know, something that makes it super easy to use ajax-functionality, some animations and handling websockets.</p>", 
        "order": "001242381682", 
        "who": "Markus Stenqvist"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 3, 
        "message": "<p>Of course it doesn't because his experience is subjective. This post might have been boring for you and others, but it was interesting for me and others. I didn't expect just facts or maybe some sketch of why Ian left the Python community. I liked the fact that he also shared his feelings with us.</p>", 
        "order": "001242019662,001242405586,001242453823,001243836719", 
        "who": "lucianu"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 2, 
        "message": "<p>OK, Google Translate makes me think the first two are well wishes, but then things get a bit weird: \"Laugh urine, give praise\" and \"Urine bar, urine it\"</p>", 
        "order": "001242475092,001243578064,001251170156", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Java Script blows nuts.  Sucks for you breh breh.</p>", 
        "order": "001242310277", 
        "who": "johndurbinn"
    }, 
    {
        "createdAt": "Fri, 14 Feb 2014", 
        "indent": 0, 
        "message": "<p>Thank you, Ian, for everything you've done for the Python community, even—especially—when it was things like virtualenv and pip that needed fixing because they weren't fun to fix. I've learned a lot from you, before, while, and after we overlapped at Mozilla.</p>", 
        "order": "001244803109", 
        "who": "jamessocol"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 0, 
        "message": "<p>Really good article, I understand the drifter feeling.</p>", 
        "order": "001242113773", 
        "who": "nonapod"
    }, 
    {
        "createdAt": "Thu, 10 Apr 2014", 
        "indent": 0, 
        "message": "<p>So You changed Python to JavaScript - i got it but what about server side ? front end is only the view - what you gonna use for back end ? node.js ?</p>", 
        "order": "001330412343", 
        "who": "Krzysztof Turkiewicz"
    }, 
    {
        "createdAt": "Thu, 13 Feb 2014", 
        "indent": 1, 
        "message": "<p>Ah, but you see, some of us are interested in *why* a change occurred. Think of it like a commit message on his life.</p>", 
        "order": "001242019662,001242861600", 
        "who": "Xiong Chiamiov"
    }, 
    {
        "createdAt": "Wed, 19 Feb 2014", 
        "indent": 0, 
        "message": "<p>I too abandoned the Python community--or more properly it abandoned me. The Python community has done horrible things and it all came to a head with \"Adria Richards.\" Python now has to be \"gender neutral\" and it's more about including Women than solving Big Computer Science Problems.</p><p>Politics and \"women's rights\" have NOTHING to do with Computer Science. The Python community has become watered down in the name of \"inclusivity\" and \"diversity\". That's why I left it.</p>", 
        "order": "001250696109", 
        "who": "Moishe Pipik"
    }
]