[
    {
        "createdAt": "Fri, 25 Apr 2014", 
        "indent": 0, 
        "message": "<p>I haven't spent much time with GitHub issues, but our team is moving our SCM to GitHub, and the integration of issues, commit messages, forks, and pull requests is very compelling. At the same time, I've had the most success with, and the most pleasure using FogBugz. It's opinionated, which, I think, is part of the reason I like it. With BugZilla and the other super-flexible tools I used, I found myself tweaking the tracker more than tracking the tweaks (through no fault of the tools... I tweak. I'm like the Miley Cyrus of coding. Except it's tweaking. Not twerking. Anyway.)</p><p>FogBugz comes with \"philosophy included\". It has \"just enough\" configurability and extensibility to address most common pain points, but it goes from zero to useful very quickly.</p><p>Contrary to how it may seem, I'm not actually trying to sell FogBugz... If you haven't used it, though, it's worth reviewing its opinions (well described in an APress(?) book: Project Management with FogBugz (?)) and seeing how many of them translate. I especially thought of this when you mentioned estimates and deadlines. FB's estimating and tracking tools are the secret sauce that makes me hesitate every time I think about moving to something else. It's what has me on the fence about switching to GitHub's issue tracker. Their \"Evidence-Based Scheduling (EBS)\" is useful both for managing expectations about the project as a whole, and, individually, for honing your task breakdown and estimating skills.</p><p>So... it's worth taking a test drive (perhaps to track a small personal project), along with reading the (thin) book, then applying what ports to your  GitHub workflow.</p>", 
        "order": "001355922464", 
        "who": "tripplilley"
    }, 
    {
        "createdAt": "Thu, 20 Mar 2014", 
        "indent": 0, 
        "message": "<p>wowowowow</p>", 
        "order": "001292853660", 
        "who": "Lava Kafle"
    }, 
    {
        "createdAt": "Mon, 24 Mar 2014", 
        "indent": 1, 
        "message": "<p>We did theme-based milestones, so the times were variable, but we tried to keep them as short as we could.</p>", 
        "order": "001296442056,001299535528", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Sat, 22 Mar 2014", 
        "indent": 0, 
        "message": "<p>Great report. Thank you. This is very similar to how we want to organize work on our team. I like the 'sky blue' bucket and 'next tasks' buckets as a permanent storage. In first bucket I would store things like 'yep, great idea but we are not doing it right now, maybe later maybe not\" and second \"yep, that's probably into next iteration milestons\". Do you strive for milestones timeboxed to the same time lenght? 2 weeks? or is each milestone theme based? <br>Thanks for sharing and links to your projects.</p>", 
        "order": "001296442056", 
        "who": "rubytester"
    }, 
    {
        "createdAt": "Sat, 17 May 2014", 
        "indent": 0, 
        "message": "<p>We still use <a href=\"https://waffle.io/\" rel=\"nofollow noopener\" title=\"https://waffle.io/\">https://waffle.io/</a><br>Visually manage tasks easier (ex. <a href=\"https://waffle.io/itcase/sacrud)\" rel=\"nofollow noopener\" title=\"https://waffle.io/itcase/sacrud)\">https://waffle.io/itcase/sa...</a></p>", 
        "order": "001390944858", 
        "who": "uralbash"
    }, 
    {
        "createdAt": "Fri, 25 Apr 2014", 
        "indent": 0, 
        "message": "<p>David Allen, of \"Getting Things Done\" fame, in a podcast, called the GTD equivalent of your \"Blue Sky dumping ground\" the \"Big Box Labeled 'Crap'\". In general, GTD is about clearing your inbox regularly and putting things in their \"proper place\" according to the GTD workflow. The podcast listener asked about \"the stuff you just aren't ready to break down, or deal with, or whatever?\"</p><p>One of the important cornerstones of the GTD methodology is the \"weekly review\". Inbox processing happens continuously, at almost realtime. The weekly review is about the larger picture. Somewhere in there (perhaps not every week) is where you would trawl the BBLC and see what you could ditch, what you could convert into a project, and what just needed to go back in.</p><p>The point of this essay is to say that making some regular block of time, in whatever period is useful to you, for reviewing the Blue Sky issues may be more fruitful than relying on serendipity. I'm a big believer in serendipity, but I don't delegate *everything* to her.</p>", 
        "order": "001355905260", 
        "who": "tripplilley"
    }, 
    {
        "createdAt": "Mon, 28 Apr 2014", 
        "indent": 0, 
        "message": "<p>Nice summary Ian! I found it still inspiring even if we work with GitHub Issues in similar manner for quite a long time already. You might want to have a look at <a href=\"http://overv.io\" rel=\"nofollow noopener\" title=\"http://overv.io\">http://overv.io</a> we wrote to address most of the mentioned shortcomings.</p>", 
        "order": "001359148064", 
        "who": "Mirek Mencel"
    }
]