[
    {
        "createdAt": "Fri, 25 Jan 2019", 
        "indent": 3, 
        "message": "<p>To be fair, there's actually some pretty awesome interfaces built on PRs (eg <a href=\"https://github.com/apps/renovate)\" rel=\"nofollow noopener\" title=\"https://github.com/apps/renovate)\">https://github.com/apps/ren...</a>. It's not crazy to think there would be a commit phase to publishing.</p>", 
        "order": "004307362293,004307389552,004307430794,004307433791", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Wed, 23 Jan 2019", 
        "indent": 0, 
        "message": "<p>Out of curiosity, have you looked into Sandstorm?  <a href=\"https://sandstorm.io/\" rel=\"nofollow noopener\" title=\"https://sandstorm.io/\">https://sandstorm.io/</a></p><p>They seem to have the same goals - providing easy hosting of anything (that works within the sandboxed environment), while also letting you transition from servers managed for you (e.g. the Sandstorm Oasis service) to servers you run yourself, if you want to.  It's unfortunate that necessary funding wasn't acquired to continue dedicating significant development time to it, but the project got decently far along.</p>", 
        "order": "004304088016", 
        "who": "digitalcircuit"
    }, 
    {
        "createdAt": "Fri, 25 Jan 2019", 
        "indent": 0, 
        "message": "<blockquote><br><br><br> I think these are ways to avoid the work of hosting, and they succeed to the degree no one uses the resulting software<br><br><br></blockquote><p></p><p>I would mostly just like to mention that you're awesome. I'm not sure I entirely agree (once you have hosting, you have to start dealing with all the problems involved in hosting, and centralization is part of that), but I like how you put it. And I totally agree that hosting is the big need. I'm running into it with my son right now, who is playing around with writing his own websites, but I don't really want to pay for dedicated server or NAT through to my desktop like I used to.</p><p>But I have one solution to this, which is that I've started using github for hosting. I'm not really that fond of git or the github workflow, but that doesn't really matter because the big need is precisely what you say: hosting. And with gh-pages, github will host anything you can squeeze into HTML/CSS/JS files. You can even use github as a datastore. See, for example, <a href=\"https://mrgiggles.github.io/histoire/\" rel=\"nofollow noopener\" title=\"https://mrgiggles.github.io/histoire/\">https://mrgiggles.github.io...</a> (note that I'm not sure they really intend to be a hosting company, so I don't know how much of this they'll really put up with.)</p>", 
        "order": "004307362293", 
        "who": "SteveFink"
    }, 
    {
        "createdAt": "Mon, 04 Mar 2019", 
        "indent": 0, 
        "message": "<p>I love this idea and completely agree that decentralized is neither desirable nor attainable.</p><p>I actually wrote about how Mozilla could implement a \"for the record\" blogging platform that sounds a lot like this concept:</p><p><a href=\"https://tomcritchlow.com/2018/09/13/for-the-record-blogging/\" rel=\"nofollow noopener\" title=\"https://tomcritchlow.com/2018/09/13/for-the-record-blogging/\">https://tomcritchlow.com/20...</a></p>", 
        "order": "004364026604", 
        "who": "Tom Critchlow"
    }, 
    {
        "createdAt": "Fri, 25 Jan 2019", 
        "indent": 1, 
        "message": "<p>Oh yeah, I absolutely use ghpages for my lightweight hosting too. But let's say you want to make some blogging software, what would a user have to do to publish their blog? Signing up for GitHub isn't terribly hard, but there's a bunch of complicated steps after that, and honestly I don't know how easy it is to create something that can write to a git repository – probably the blog software still has to have its own server, though at least it wouldn't have to actually handle hosting people's blogs.</p><p>If you did figure out a way to make it feasible, I have a feeling GitHub would not be appreciative (and might block the tool). My understanding is that ghpages is pretty cheap to run, but I suspect they rely on a certain niche status to make the other operational issues reasonable.</p><p>That said, my understanding of the economics of static publishing is that they are very reasonable, and one server can serve literally hundreds of thousands of (low-traffic) sites. It's all about the hassle. And the more accessible you make your service, they more you are opening yourself up to hassles.</p>", 
        "order": "004307362293,004307389552", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Fri, 25 Jan 2019", 
        "indent": 2, 
        "message": "<p>Yeah, fair. The app that I mentioned does most modifications via an IRC bot with its own github account, so it can push the updates. But that only works because it's... well, hosted somewhere. (On an otherwise-abandoned machine sitting underneath a co-worker's desk, but whatever.)</p><p>To do any other form of edits, it gives you a link to create a github PR, which isn't exactly a general solution.</p>", 
        "order": "004307362293,004307389552,004307430794", 
        "who": "SteveFink"
    }, 
    {
        "createdAt": "Sun, 21 Apr 2019", 
        "indent": 2, 
        "message": "<p>Thanks for expanding.</p><p>I'm not personally interested in combatting censorship, excepting the kind that is self inflicted in response to phantasms.</p><p>There is a company that is a paragon of affordable hosting: <a href=\"http://www.NearlyFreeSpeech.net\" rel=\"nofollow noopener\" title=\"www.NearlyFreeSpeech.net\">www.NearlyFreeSpeech.net</a>.</p><p>They go to extra ordinary lengths to ensure the customer price is directly related to the individuals usage patterns and NFS' costs to support that , and they're very transparent about it. I have complete faith in their integrity.</p><p>Where they fail in regards to your topic is in general usability. It's only a service for the capable and sysadmin savvy, a narrow niche.</p><p>I've long wished other companies would follow their spirit, adapted to a general audience, or at least different audiences.</p><p>...</p><p>Email for all it's warts is still the best example we have of an open system that everyone can participate in, with a minimum of fuss. All platforms, all devices,  and almost all software can at least interact with it if not outright do it. It's centralized (mailing lists) and distributed (inboxes) at the same time.</p><p>In my opinion for an open web to grow and thrive it needs to be like email. (In spirit. I'm not referring to its technical structure.)</p>", 
        "order": "004425374308,004425403311,004431923020", 
        "who": "Matt Wilkie"
    }, 
    {
        "createdAt": "Tue, 16 Apr 2019", 
        "indent": 0, 
        "message": "<p>Could you expand on why you think decentralized hosting / federation / P2P isn't desirable?</p>", 
        "order": "004425374308", 
        "who": "Matt Wilkie"
    }, 
    {
        "createdAt": "Thu, 24 Jan 2019", 
        "indent": 1, 
        "message": "<p>Yes, I thought they were doing interesting things with that (I played around in that area myself a very long time ago, in <a href=\"https://bitbucket.org/ianb/silverlining/src)\" rel=\"nofollow noopener\" title=\"https://bitbucket.org/ianb/silverlining/src)\">https://bitbucket.org/ianb/...</a>. Though I didn't think they were targeting something that was really consumer accessible. I'm not actually sure you can take current applications and offer them to a wide breadth of users. Though the alternative is to create a new environment and go down a Build It And They Will Come path, with its own dangers.</p>", 
        "order": "004304088016,004304332110", 
        "who": "Ian Bicking"
    }, 
    {
        "createdAt": "Tue, 16 Apr 2019", 
        "indent": 1, 
        "message": "<p>I don't think decentralization offers any real features, but has many costs. It's not cheaper, the costs are just distributed. Fully decentralized means there's no one taking any responsibility, and you are hoping that initial engineering can anticipate all the problems. Federated means there's just several people taking responsibility, in a functional federated system there's a kind of cabal of responsible people, and in a dysfunctional system no one really takes care of anything. All of this to solve the wrong problem.</p><p>You want to provide affordable hosting that isn't subsidized with ads or other manipulation? The easiest and cheapest and most reliable way to do that is with traditional web hosting. People are successfully doing that right now with a very low cost. The attention required to maintain those services is not as cheap, but decentralization doesn't solve that problem (except by creating a completely unmaintained space).</p><p>Do you want to create something that is hard to censor? From what I can tell the only solid way to do that is some form of steganography: you have to hide things in other traffic, other protocols, other materials. I don't have an answer, but I'm not confident decentralization technologies answer this either. It's also unclear to me that anti-censorship should be the highest priority. It feels like an aside.</p><p>The real challenge I see is in making something that is accessible, that addresses a bunch of use cases, that gets good user consent for changes, that provides management both within and above individual use cases or applications, allows some kind of cohesive information architecture despite disparate applications, etc.</p>", 
        "order": "004425374308,004425403311", 
        "who": "Ian Bicking"
    }
]